emacs.d/init.el

(use-package vterm
  :vc (:url "https://github.com/akermu/emacs-libvterm" :branch "master")
  :ensure t)

(use-package popper
  :ensure t
  :bind (("C-ù" . popper-toggle)
         ("M-ù" .  popper-cycle)
         ("C-M-ù" . popper-toggle-type))
  :init
  (setq popper-window-height 12)
  (setq popper-reference-buffers
      '("\\*Messages\\*"
        "Output\\*$"
        "\\*Async Shell Command\\*"
        help-mode
        compilation-mode
        "^\\*eshell.*\\*$" eshell-mode
        "^\\*vterm.*\\*" vterm-mode
        "^\\*Python\\*"
        "^\\*julia\\*"))
  (popper-mode +1)
  (popper-echo-mode +1))

(use-package org
  :hook
  (org-mode . visual-line-mode)
  (org-mode . variable-pitch-mode)
  :custom
  (org-id-link-to-org-use-id t)
  (org-ellipsis " ▾")
  ;; (org-hide-emphasis-markers t)
  (org-startup-folded t)
  (org-fontify-quote-and-verse-blocks t)
  (org-startup-indented t)
  :config
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((shell . t)
      (gnuplot . t)
      (python . t)
      (emacs-lisp . t))))

;; Center org document
(use-package olivetti
  :ensure t
  :hook
  (org-mode . olivetti-mode)
  :custom
  (olivetti-body-width 150))

;; Sleek look
(use-package org-modern-indent
  :vc (:url "https://github.com/jdtsmith/org-modern-indent" :rev :newest)
  :ensure t
  :config
  (add-hook 'org-mode-hook #'org-modern-indent-mode 90))

;; This is needed as of Org 9.2
(use-package org-tempo
  :after (org)
  :config
  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
  (add-to-list 'org-structure-template-alist '("json" . "src json")))

(use-package org-superstar
  :ensure t
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-remove-leading-stars t)
  (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●")))

(use-package org-faces
  :after (color)
  :custom-face
  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (org-block ((t (:inherit 'fixed-pitch))))
  (org-table ((t (:inherit 'fixed-pitch))))
  (org-formula ((t (:inherit 'fixed-pitch))))
  (org-code ((t (:inherit 'fixed-pitch))))
  (org-verbatim ((t (:inherit 'fixed-pitch))))
  (org-tag ((t (:inherit 'fixed-pitch)))))

(use-package gnuplot :ensure t)

(use-package ox-gfm
  :ensure t
  :init
  (with-eval-after-load 'org
    '(require 'ox-gfm nil t)))

(use-package gptel
  :ensure t
  :bind (("C-c g" . gptel-menu))
  :config
  (setq
   gptel-default-mode 'org-mode
   gptel-model 'claude-3-5-sonnet-20240620
   gptel-backend (gptel-make-anthropic "Claude" :stream t :key gptel-api-key)))

(use-package inline-diff
  :vc t
  :load-path "~/.emacs.d/local/inline-diff"
  :ensure t
  :after gptel-rewrite)

(use-package gptel-rewrite
  :vc (:url "https://github.com/karthink/gptel" :branch "main")
  :ensure t
  :after gptel
  :bind (:map gptel-rewrite-actions-map
     ("C-c C-i" . gptel--rewrite-inline-diff))
  :config
  (defun gptel--rewrite-inline-diff (&optional ovs)
    "Start an inline-diff session on OVS."
    (interactive (list (gptel--rewrite-overlay-at)))
    (unless (require 'inline-diff nil t)
      (user-error "Inline diffs require the inline-diff package."))
    (when-let* ((ov-buf (overlay-buffer (or (car-safe ovs) ovs)))
                ((buffer-live-p ov-buf)))
      (with-current-buffer ov-buf
        (cl-loop for ov in (ensure-list ovs)
                 for ov-beg = (overlay-start ov)
                 for ov-end = (overlay-end ov)
                 for response = (overlay-get ov 'gptel-rewrite)
                 do (delete-overlay ov)
                 (inline-diff-words
                  ov-beg ov-end response)))))
  (when (boundp 'gptel--rewrite-dispatch-actions)
    (add-to-list
     'gptel--rewrite-dispatch-actions '(?i "inline-diff")
     'append))

  (defun gpltr/gptel--rewrite-directive-default ()
    "Generic directive for rewriting or refactoring.

    These are instructions not specific to any particular required
    change.

    The returned string is interpreted as the system message for the
    rewrite request.  To use your own, add a different directive to
    `gptel-directives', or add to `gptel-rewrite-directives-hook',
    which see."
    (let* ((lang (downcase (gptel--strip-mode-suffix major-mode)))
           (article (if (and lang (not (string-empty-p lang))
                                 (memq (aref lang 0) '(?a ?e ?i ?o ?u)))
                        "an" "a")))
      (if (derived-mode-p 'prog-mode)
          (format (concat "You are %s %s programmer.  "
                          "Follow my instructions and refactor %s code I provide.\n"
                          "- Generate ONLY %s code as output, without "
                          "any explanation or markdown code fences.\n"
                          "- Generate code in full, do not abbreviate or omit code.\n"
                          "- Do not ask for further clarification, and make "
                          "any assumptions you need to follow instructions.")
                  article lang lang lang)
        (concat
         "You are an a grammatical and spelling expert in all language."
         (if (string-empty-p lang)
             ""
           (format "You are in a %s %s editor." article lang))
         "  Follow my instructions and only fix mistakes in the text I provide."
         "  Generate ONLY the replacement text,"
         " without any explanation."))))
  (add-hook 'gptel-rewrite-directives-hook 'gpltr/gptel--rewrite-directive-default))

(defun gpltr/gptel-from-anywhere ()
  (interactive)
  (let* ((display-width (display-pixel-width))
         (display-height (display-pixel-height))
         (frame-width (/ display-width 3))
         (frame-height display-height))
    (make-frame `((window-system . ns)
                  (left . 0)
                  (top . 0)
                  (width . 80)
                  (height . 999))))
  (gptel "My:AI Chat" gptel-api-key nil)
  (switch-to-buffer "My:AI Chat")
  (delete-other-windows))
