emacs.d/config.org
*** Emacs everywhere

#+begin_src emacs-lisp
  (use-package emacs-everywhere
    :vc (:url "https://github.com/tecosaur/emacs-everywhere" :branch "master" :rev :newest)
    :ensure t)
#+end_src

On macos, you will need to install http://www.hammerspoon.org/ and put
#+begin_src lua :tangle ~/.hammerspoon/init.lua
  hs.hotkey.bindSpec({hyper, "e"},
    function()
      hs.execute("/Applications/Emacs.app/Contents/MacOS/bin/emacsclient --eval '(emacs-everywhere)'")
    end
  )
#+end_src

