emacs.d/init.el

(use-package emacs-everywhere
  :vc (:url "https://github.com/tecosaur/emacs-everywhere" :branch "master" :rev :newest)
  :ensure t)
